var provinces={
 北京市:["昌平","朝阳","崇文","大兴","房山","丰台","海淀","怀柔","门头沟","密云","平谷","石景山","顺义","通州","东城","西城","宣武","延庆"],
 上海市:["宝山","长宁","崇明","奉贤","虹口","黄浦","嘉定","静安","金山","卢湾","闵行","南汇","浦东","青浦","松江","普陀","徐汇","杨浦","闸北"], 
 天津市:["宝坻","北辰","大港","东丽","汉沽","河北","和平","河东","红挢","河西","蓟县","静海","津南","南开","宁河","塘沽","西青","武清"], 
 重庆市:["巴南","壁山","长寿","城口","大渡口","大足","北碚","丰都","奉节","涪陵","合川","江津","江北","九龙坡","开县","梁平","南岸","南川","黔江","綦江","彭水","荣昌","沙坪坝","石柱","双挢","潼南","铜梁","万盛","万州","武隆","巫山","巫溪","秀山","酉阳","永川","渝北","渝中","云阳","垫江","忠县"], 
 港澳台:["中国台湾","中国香港","中国澳门"],
 安徽省:["安庆市","蚌埠市","巢湖市","池州地区","滁州市","阜阳市","合肥市","黄山市","淮北市","淮南市","马鞍山市","六安市","宿州市","铜陵市","芜湖市", "宣城地区"],
 青海省:["果洛藏族","海北藏族","海东地区","海西蒙古","海南藏族","黄南藏族","西宁市","玉树藏族"],
 福建省:["福州市","南平市","宁德市","龙岩市","莆田市","泉州市","三明市","厦门市","漳州市"],
 甘肃省:["白银市","定西地区","甘南藏族自治州","嘉峪关市","金昌市","酒泉地区","兰州市","陇南地区","临夏回族自治州","平凉地区","庆阳地区","天水市","武威地区","张掖地区"],
 广东省:["潮州市","东莞市","佛山市","广州市","河源市","惠州市","梅州市","揭阳市","江门市","茂名市","清远市","韶关市","汕头市","汕尾市","深圳市","云浮市","阳江市","珠海市","肇庆市","湛江市"],
 贵州省:["安顺地区","毕节地区","贵阳市","六盘水市","黔东南苗族侗族自治地区","黔南布依族苗族自治区", "黔西南布依族苗族自治州","铜仁地区","遵义市"],
 海南省:["白沙","保亭","儋州","东方","昌江","澄迈","定安","海口市","乐东","临高","陵水","琼中","琼海","琼山","三亚市","省直辖行","屯昌","通什","万宁","文昌"],
 河北省:["保定市","沧州市","承德市","邯郸市","衡水市","廊坊市","秦皇岛市","石家庄","唐山市","邢台市","张家口市"], 
 湖北省:["鄂州市","恩施土家族苗族自治州","黄冈市","黄石市","荆门市","荆州市","十堰市","省直辖行政单位","武汉市","襄攀市","襄樊市","孝感市","咸宁市","宜昌市"],
 黑龙江省:["大庆市","大兴安岭行署","哈尔滨市","鹤岗市","黑河市","佳木斯市","鸡西市","牡丹江市","齐齐哈尔市","七台河市","双鸭山市","绥化市","伊春市"],
 河南省:["安阳市","鹤壁市","焦作市","开封市","洛阳市","漯河市","南阳市","平顶山市","濮阳市","商丘市","三门峡市","新乡市","信阳市","许昌市","郑州市","省直辖行政单位","周口地区","驻马店地区"],
 湖南省:["长沙市","常德市","怀化市","衡阳市","娄底市","邵阳市","湘潭市","湘西土家族苗族自治州","益阳市","岳阳市","永州市","张家界市","株洲市"],
 江苏省:["沭阳市","昆山市","泰兴市","常州市","淮阴市","连云港","南京市","南通市","宿迁市","苏州市","泰州市","无锡市","徐州市","盐城市","扬州市","镇江市"],
 江西省:["抚州地区","赣州市","九江市","景德镇市", "吉安地区","南昌市","萍乡市","上饶地区", "新余市","鹰潭市", "宜春地区"],
 吉林省:["白山市","白城市","辽源市","长春市","吉林市","松原市", "四平市","通化市","延边朝鲜族自治州"],
 辽宁省:["鞍山市","本溪市","朝阳市","丹东市", "大连市","阜新市","葫芦岛市","锦州市","抚顺市","辽阳市","盘锦市","沈阳市","铁岭市", "营口市"],
 四川省:["阿坝藏族羌族自治州","甘孜藏族自治州","巴中地区", "成都市","德阳市","达川市","广安市","广元市", "凉山彝族自治州", "乐山市","泸州市","绵阳市","眉山地区","南充市","内江市","攀枝花市", "遂宁市",  "宜宾市","自贡市","资阳地区","雅安地区"],
 陕西省:["安康地区","宝鸡市","汉中市","商洛地区","铜川市","渭南市","西安市","咸阳市","延安市","榆林市"],
 山东省:["德州市","滨州地区","东营市","菏泽地区","济南市","济宁市","聊城市","临沂市","莱芜市","青岛市","日照市","泰安市","潍坊市","威海市","烟台市","淄博市","枣庄市"],
 山西省:[ "大同市","晋城市","晋中市","吕梁地区","临汾地区","朔州市","太原市","忻州地区", "阳泉市","运城地区"], 
 云南省:["保山地区","楚雄彝族自治州","迪庆藏族自治州","大理白族自治州","德宏傣族景颇族自治州","红河哈尼族自治州","昆明市","丽江地区","怒江僳僳族自治州","临沧地区","曲靖市","思茅地区", "文山壮族自治州","西双版纳傣族自治州","玉溪市","昭通地区"],
 浙江省:["杭州市", "湖州市","金华市","嘉兴市","宁波市","丽水地区","绍兴市","台州市","温州市","舟山市"], 
 内蒙古自治区:["阿拉善盟","包头市","巴彦淖尔盟", "赤峰市","呼和浩特","呼伦贝尔盟","乌海市","乌兰察布盟","兴安盟","锡林郭勒盟","伊克昭盟", "哲里木盟"], 
 宁夏回族自治区:["固原地区", "石嘴山市","银川市","吴忠市"],
 广西壮族自治区:["百色地区","北海市","防城港市","贵港市","桂林市","河池地区","贺州地区","柳州市","柳州地区","南宁市","南宁地区","钦州市","梧州市","玉林市"], 
 西藏自治区:["阿里地区","昌都地区","林芝地区","那曲地区","日喀则","拉萨市","山南地区"], 
 新疆维吾尔自治区:["阿勒泰地区","巴音郭楞蒙古自治州","博尔塔拉蒙古自治州","昌吉回族自治州","阿克苏地区","克拉玛依市","克孜勒苏柯尔克孜", "哈密地区","和田地区","喀什地区","吐鲁番地区", "塔城地区","乌鲁木齐市","伊犁哈萨克自治州", "伊犁地区","自治区直辖行政单位"]
 };  
 //加载省   
 function loadProvince()   
 { 
  //获取省所对应的列表框对象   
  var pro=document.getElementById("province");   
  //从数组中提取省份信息   
  for(var p in provinces)   
  {   
   //创建option元素   
   var opt=document.createElement("option");   
   //设置option元素中的信息   
   opt.innerText=p;   
   opt.value=p;   
   //将option元素添加到select元素中(option是select的子节点)   
   pro.appendChild(opt);   
  }   
 }   
 //加载市   
 function loadCity()   
 {   
  //获取用户的省份   
  var selectProvince=document.getElementById("province").value;
  if(selectProvince == " "){
  	return ;
  }
  if(selectProvince == ""){
  	return ;
  }
  //根据省获取市(citys是一个数组)   
  var citys=provinces[selectProvince];   
  //获取市所对应的列表框对象   
  var city=document.getElementById("city");   
  //将元素列表框中的元素全部清空   
  city.innerText="";   
     
  var opt=document.createElement("option");   
  opt.innerText="--请选择城市--";   
  opt.value="";   
  city.appendChild(opt);   
  for(var index=0;index<citys.length;)   
  {   
   opt=document.createElement("option");   
   opt.innerText=citys[index];   
   opt.value=citys[index];   
   city.appendChild(opt);
   index = index + 1;   
  }   
 }   
   
window.onload = loadProvince;
 